# RoomFinishWall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomFinishWall Property
ParameterTypeId Class See Also
---
"Wall Finish"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomFinishWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomFinishWall As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomFinishWall {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace